



# 时间分类触发词

class TriggerWord():

    fuzzy=["最近","那时","当今","刚刚","目前","如今"]
    duration=["至","内","个"]
    settime=[r"/","每","天天"]
    # 年月日周号小时分点秒
    set_unit={"年":"Y","月":"M","月份":"M","周":"W","日":"D","号":"D","天":"D","小时":"h","点":"h","时":"h","分钟":"m","分":"m","秒":"s"}


    TIME_NUM = {
        '〇': 0,'零': 0, '一': 1, '二': 2, '两': 2, '三': 3, '四': 4,
        '五': 5, '六': 6, '七': 7, '八': 8, '九': 9,'廿':20,'卅':30,'卌':40,
        '0': 0, '1': 1, '2': 2, '3': 3, '4': 4,
        '5': 5, '6': 6, '7': 7, '8': 8, '9': 9,
        r'\uFF10':0,r'\uFF11':1,r'\uFF12':2,r'\uFF13':3,r'\uFF14':4,r'\uFF15':5,r'\uFF16':6,r'\uFF17':7,r'\uFF18':8,r'\uFF19':9,
        '十': 10, '百': 100, '千': 1000, '万': 10000
    }

    date_unit = {
        "year": '0000',
        "month": '00',
        "day": '00',
        "hour": '00',
        "minute": '00',
        "second": '00',
    }

    holi_solar={
      "植树节": "03-12",
      "圣诞节": "12-25",
      "青年节": "05-04",
      "教师节": "09-10",
      "儿童节": "06-01",
      "元旦": "01-01",
      "国庆": "10-01",
      "劳动节": "05-01",
      "妇女节": "03-08",
      "建军节": "08-01",
      "航海日节": "07-11",
      "建党节": "07-01",
      "记者节": "11-08"
    }





if __name__ == "__main__":
    print(TriggerWord.settime)